---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
MathComparisonUtils Methods
MathComparisonUtils Class See Also Send Feedback
---

The MathComparisonUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | IsAlmostEqual | Checks if two doubles are almost equal, using the internal tolerance. |
|  | IsAlmostZero | Checks if value is almost zero, using the internal tolerance. |
|  | IsGreaterThan | Checks if value1 is strictly greater than value2, using the internal tolerance. |
|  | IsGreaterThanOrAlmostEqual | Checks if value1 is greater than or almost equal to value2, using the internal tolerance. |
|  | IsLessThan | Checks if value1 is strictly less than value2, using the internal tolerance. |
|  | IsLessThanOrAlmostEqual | Checks if value1 is less than or almost equal to value2, using the internal tolerance. |

# See Also

MathComparisonUtils Class

Autodesk.Revit.DB Namespace